#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
heroku_app.dev: Refreshing state... [id=vipotin-devops-project]
heroku_build.dev: Refreshing state... [id=ed09bffe-5edf-41f9-b48c-bda6bc04431c]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # heroku_build.dev has been changed
  ~ resource "heroku_build" "dev" {
        id                = "ed09bffe-5edf-41f9-b48c-bda6bc04431c"
      ~ output_stream_url = "https://build-output.heroku.com/streams/6b/6be5ff3c-769e-43fc-9e39-887826e526be/logs/ed/ed09bffe-5edf-41f9-b48c-bda6bc04431c.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210723%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210723T085136Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=d36b163f8bf2522f9595465bb9dfb89eebaba7adc0af421565e000b37bfec295" -> "https://build-output.heroku.com/streams/6b/6be5ff3c-769e-43fc-9e39-887826e526be/logs/ed/ed09bffe-5edf-41f9-b48c-bda6bc04431c.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210723%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210723T090030Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=ee8bfa7461aa6216186082c95818c6ea5768333604d7a4e1e0079ce1f7b74884"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # heroku_build.dev must be replaced
-/+ resource "heroku_build" "dev" {
      ~ buildpacks        = [] -> (known after apply)
      ~ id                = "ed09bffe-5edf-41f9-b48c-bda6bc04431c" -> (known after apply)
      ~ local_checksum    = "SHA256:2dd16f81f735441b128b1b69c55652700cde2d7b94f9dad01d97e5a7a722cc3a" -> "SHA256:4707e4da845f3679a25b8a72983cbf354c03267b17637db7280df061a399ff30" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/6b/6be5ff3c-769e-43fc-9e39-887826e526be/logs/ed/ed09bffe-5edf-41f9-b48c-bda6bc04431c.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210723%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210723T090030Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=ee8bfa7461aa6216186082c95818c6ea5768333604d7a4e1e0079ce1f7b74884" -> (known after apply)
      ~ release_id        = "98d6f98c-1cff-4e15-9a75-0a0a52a392de" -> (known after apply)
      + slug_id           = (known after apply)
      ~ stack             = "container" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "vilma.pohjonen@gmail.com"
              - id    = "ebef8776-a5e7-4580-b285-7eb2d8bcfc72"
            },
        ] -> (known after apply)
      ~ uuid              = "ed09bffe-5edf-41f9-b48c-bda6bc04431c" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vipotin, Action: `pull_request`*